In [1]:
import pandas as pd 
import numpy as np

In [13]:
a = [1,5]
b = [6,7]
df = pd.DataFrame([a,b],index = ["one","two"],columns = ["ram","shyam"])
df

     ram  shyam
one    1      5
two    6      7

In [17]:
# create dataframe using list and dictionary

df = {'A':[1,2],'B':[6,0],'C':[9,3]}
new_df = pd.DataFrame(df)
print(new_df)

   A  B  C
0  1  6  9
1  2  0  3

In [19]:
# Empty dataframe
df = pd.DataFrame()

In [32]:
# create dataframe from single ndarray
A = np.array([2,4,8,6])
df = pd.DataFrame(A)
print(df)

   0
0  2
1  4
2  8
3  6

In [37]:
# create dataframe from 2 ndarray
A = np.array([2,4,8,6])
B = np.array([3,5,9,0])
df = pd.DataFrame([A,B])
print(df)

   0  1  2  3
0  2  4  8  6
1  3  5  9  0

In [83]:
#agar index number and column number apne dene ho to 
l1 = np.array(["naveen","kunal","narayan","satyam"])
l2 = np.array([3,5,8,4])
df = pd.DataFrame([l1,l2],index = ['a','b'],columns = ['one','two','Three','four'])

# Agar column ki value change kri ho to 
df["one"]=[90,20]
# agar ek aur row add krni ho
df.loc[2]=[0,0,0,0]
df

   one    two    Three    four
a   90  kunal  narayan  satyam
b   20      5        8       4
2    0      0        0       0

In [84]:
# agar ek row delete krni ho 
df.drop(2,axis = 0)

# multiple row ek sath
df.drop(["book","roll no","id"],axis = 0)

   one    two    Three    four
a   90  kunal  narayan  satyam
b   20      5        8       4

In [79]:
ld = [{'a':10,'b':20},{'a':5,'b':10,'c':20}]
df = pd.DataFrame(ld)
df.loc[2] = 20
df

    a   b     c
0  10  20   NaN
1   5  10  20.0
2  20  20  20.0

In [89]:
# give the example of dataframe using two dictionary
a = {'a':12,'b':15,"c":19}
b = {'a':12,'b':15,"c":19}
df = pd.DataFrame([a,b])
df

    a   b   c
0  12  15  19
1  12  15  19

In [90]:
#column name change krne ke lie 
df = df.rename({'a':'number'},axis = 'columns')
df

   number   b   c
0      12  15  19
1      12  15  19

In [99]:
# agar index number ke name change krne ho 
df = df.rename({'a':'num',1:'number'},axis = 'index')
df

        number   b
num         12  15
number      12  15

In [102]:
# delete column 
df.drop('c',axis = 1,inplace = True)

In [105]:
df

        number   b   c
num         12  15  10
number      12  15  10

In [117]:
a = {'Name':['anju','Suman'],'class':[7,11]}
df = pd.DataFrame(a)

In [118]:
df

    Name  class
0   anju      7
1  Suman     11

In [119]:
# insert new column 
df['Roll no'] = (21,22)

In [121]:
# change column vqlue
df['Roll no'] = (23,27)

In [123]:
df['class'] = 12

In [126]:
df = df.rename({0:'first',1:'second'},axis = 'index')

In [127]:
df

         Name  class  Roll no
first    anju     12       23
second  Suman     12       27

In [132]:
# second method of rename index name 
df.index = ['first','Second','third']

In [129]:
df

         Name  class  Roll no
first    anju     12       23
Second  Suman     12       27

In [130]:
df.loc[len(df.index)] = ('Suman',9,11)

In [133]:
df

         Name  class  Roll no
first    anju     12       23
Second  Suman     12       27
third   Suman      9       11

In [134]:
df.loc['preeti'] = 0

In [135]:
df

         Name  class  Roll no
first    anju     12       23
Second  Suman     12       27
third   Suman      9       11
preeti      0      0        0

In [147]:
x = {'Emp no':[1,2,3],
     'Ename':['Anil','Sunil','Suman']}
df = pd.DataFrame(x,index = ['one','Two','Third'])

In [148]:
df

       Emp no  Ename
one         1   Anil
Two         2  Sunil
Third       3  Suman

In [150]:
df.loc['one']

Emp no       1
Ename     Anil
Name: one, dtype: object

In [154]:
df['Ename']

one       Anil
Two      Sunil
Third    Suman
Name: Ename, dtype: object

In [156]:
X = {'Arnab':[90,91,85,97],
     'Ramit':[92,81,86,96],
     'Samridhi':[89,54,87,68],
     'Riya':[81,87,93,62],
     'mallika':[45,77,98,77]}
df = pd.DataFrame(X,index = ['math','Science','english','hindi'])

In [157]:
df

         Arnab  Ramit  Samridhi  Riya  mallika
math        90     92        89    81       45
Science     91     81        54    87       77
english     85     86        87    93       98
hindi       97     96        68    62       77

In [160]:
# jiske marks 89 se uper honge vha true hoga 
df.loc['math']>89

Arnab        True
Ramit        True
Samridhi    False
Riya        False
mallika     False
Name: math, dtype: bool

In [ ]:
weather = pd.read_CSV('')